Revit 2027 API
BuiltInDockablePanes Properties
The DockablePanes.BuiltInDockablePanes type exposes the following members.
Properties
Name | Description
AutodeskAssistant |  The AI Assistant pane.
ContentDelivery |  The content delivery pane.
ElementView |  The element view pane.
FabricationPartBrowser |  The Fabrication part browser pane.
FormaAnalysisBrowser |  Forma Analysis Browser pane.
FormaWindAnalysisML |  Forma Wind Analysis ML pane.
HostByLinkNavigator |  The host by link navigator pane.
PnIdModelerBrowser |  The P&ID modeler browser pane.
ProjectBrowser |  The project browser pane.
PropertiesPalette |  The properties palette pane.
RebarBrowser |  The rebar browser pane.
SharedViews |  The shared view pane.
SystemNavigator |  The system browser pane.
ViewBrowser |  The View browser pane.
Top
See Also
Reference
DockablePanes.BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace